package com.itheima.constructor;

public class 总结 {
    public static void main(String[] args) {
/*
        类（定义）：相同事务共同特征的描述
        对象（定义）：对象是类的具体的实例。
        在java中必须先定义类，才能得到对象
        -------------------------------
        定义类的格式  public class 类名{
        1、成员变量
        2、成员方法
        3、构造器
        4、代码块
        5、内部类
        }
        --------------------------------
        定义类的注意事项：
        1、名字驼峰
        2、一个java文件内只能有一个类是public修饰的，而且public修饰的类名必须成为Java代码的文件名称，否则报错
        --------------------------------
        成员一般不建议给初始值，有默认的初始值
        --------------------------------
        构造器（作用）：初始化一个类的对象，并返回这个对象的地址
        无参构造器:初始化一个类的对象，并返回这个对象的地址，里面的数据都是默认值
        有参数构造器：初始化一个对象，并返回这个对象的地址，并且可以同时为对象赋值
        任何类写出来自带一个无参数构造器，但是如果定义了一个有参数构造器，那么无参数构造器就没了，需要重新写
        --------------------------------
        在构造器内部，this指的是构造器初始化的对象，在方法里面的时候，是指向方法里面的变量
        --------------------------------
        javaBean:也可以称为实体类（在生活中真实存在的对象，比如学生，用户，汽车），其对象可以用于在程序中封装数据
        书写要求：
        1、成员变量必须使用private修饰
        2、提供成员变量对应的setXxx（）/getXxx()方法。
        3、必须提供一个无参构造器；有参数构造器是可写可不写的。
        --------------------------------



*/


    }
}
